src/InformationRegisters/СХК_ВыпускПоЭтапу/СХК_ВыпускПоЭтапу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ВыпускПоЭтапу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопКоличество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СХК_СтатусВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопУпаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерииНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиДок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Линия</name>
    <type>
      <types>EnumRef.СХКТруд_Линии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СХК_ВыпускПоЭтапу/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	ТаблДокум = ПечатьНаСервере();
	ТаблДокум.Показать("Печать документа");
	ЭтаФорма.Закрыть();
КонецПроцедуры   

&НаСервере
Функция ПечатьНаСервере()
	
	
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум.Очистить();  
	
	Макет = РегистрыСведений.СХК_ВыпускПоЭтапу.ПолучитьМакет("ПалетныйЛист"); 
	
	//Шапка = Макет.ПолучитьОбласть("Шапка");	
	
	QRСтрока = Строка(Запись.ЭтапПроизводства.УникальныйИдентификатор())+";"+Строка(Запись.СерииНоменклатуры)+";"+Строка(Запись.НомерСтрокиДок)
	+ ";" +Строка(Запись.Упаковка);  
	
	//Сообщить(QRСтрока);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Если Не ПустаяСтрока(QRСтрока) Тогда
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКодаРег(QRСтрока, 0, 190);
		
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьСтрока.Рисунки["QRКод"].Картинка = КартинкаQRКода;
		Иначе
			ТекстСообщения = "Не удалось сформировать QR-код для документа";
			#Если Клиент Тогда
				Сообщить(ТекстСообщения);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;  
	
	
	ОбластьСтрока.Параметры.Номенклатура = Строка(Запись.ЭтапПроизводства.ВыходныеИзделия[0].Номенклатура);  
	
	//ОбластьСтрока.Параметры.Количество =  Строка(Запись.Количество) + " шт";
	//ОбластьСтрока.Параметры.Содержимое = "Содержимое : " + Строка(Запись.Упаковка) +" "+ Строка(Запись.Количество/Запись.Упаковка.Числитель) + " шт";
	///                                  
	ОбластьСтрока.Параметры.Количество = Строка((Запись.Количество)) + " шт";
	
	Если Запись.ДопВыпуск = Истина Тогда 
		Если Запись.ДопУпаковка.Числитель >=1 Тогда
			ДопК = Запись.ДопКоличество/Запись.ДопУпаковка.Числитель;
		Иначе
			ДопК = Запись.ДопКоличество;
		КонецЕсли;
		
		Если Запись.Количество >=1 Тогда
			Попытка
				ОбластьСтрока.Параметры.Содержимое = "Содержимое : " + Строка(Запись.Упаковка) +" "+ Строка((Запись.Количество-Запись.ДопКоличество)/Запись.Упаковка.Числитель) + " шт" + Символы.ПС +
				"Дополнительно: "+ Строка(Запись.ДопУпаковка) +" "	+ Строка(ДопК) + " шт.";
			Исключение
				ОбластьСтрока.Параметры.Содержимое = "Содержимое : " + Строка(Запись.Упаковка) +" "+ Строка(Запись.Количество/Запись.Упаковка.Числитель) + " шт" + Символы.ПС +
				"Дополнительно: "+ Строка(Запись.ДопУпаковка) +" "	+ Строка(ДопК) + " шт.";
			КонецПопытки;
		Иначе 
			ОбластьСтрока.Параметры.Содержимое = "Дополнительно: "+ Строка(Запись.ДопУпаковка) +" "	+ Строка(ДопК) + " шт.";
		КонецЕсли;
	Иначе
		Попытка
			ОбластьСтрока.Параметры.Содержимое = "Содержимое : " + Строка(Запись.Упаковка) +" "+ Строка((Запись.Количество-Запись.ДопКоличество)/Запись.Упаковка.Числитель) + " шт";
		Исключение
			ОбластьСтрока.Параметры.Содержимое = "Содержимое : " + Строка(Запись.Упаковка) +" "+ Строка(Запись.Количество/Запись.Упаковка.Числитель) + " шт";
		КонецПопытки;
		
	КонецЕсли;
	
	///
	ОбластьСтрока.Параметры.ДатаВыпуска = "Дата Выпуска : " + Строка(Формат(Запись.СерииНоменклатуры.ДатаПроизводства, "ДЛФ=Д"));
	ОбластьСтрока.Параметры.ГоденДо	 = "Годен До : " + Строка(Формат(Запись.СерииНоменклатуры.ГоденДо, "ДЛФ=Д"));
	ОбластьСтрока.Параметры.СкладПолучатель	 = "Склад получатель : " + Строка(Запись.СкладПолучатель); 
	ОбластьСтрока.Параметры.НомерЛиста	 = "Паллетный лист № : " + Строка(Запись.НомерСтрокиДок); 
	
	ТаблДокум.Вывести(ОбластьСтрока); 
	ТаблДокум.АвтоМасштаб = Истина;
	ТаблДокум.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТаблДокум;
	
КонецФункции   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	
	Админ = Справочники.ГруппыПользователей.НайтиПоНаименованию("Администраторы"); 
	
	ОтборАдмин = Новый Структура;
	ОтборАдмин.Вставить("Пользователь",ТекПользователь);
	СтрокаАдмин = Админ.Состав.НайтиСтроки(ОтборАдмин);
	Если СтрокаАдмин.Количество()>=1 Тогда  
		
	Иначе 
		ЭтаФорма.Элементы.Период.Доступность = Ложь;		
		ЭтаФорма.Элементы.ЭтапПроизводства.Доступность = Ложь;		
		ЭтаФорма.Элементы.Помещение.Доступность = Ложь;		
		ЭтаФорма.Элементы.СкладПолучатель.Доступность = Ложь;		
		ЭтаФорма.Элементы.Упаковка.Доступность = Ложь;		
		ЭтаФорма.Элементы.Количество.Доступность = Ложь;		
		ЭтаФорма.Элементы.ДопКоличество.Доступность = Ложь;		
		ЭтаФорма.Элементы.ДопУпаковка.Доступность = Ложь;		
		ЭтаФорма.Элементы.Статус.Доступность = Ложь;		
		ЭтаФорма.Элементы.НомерСтрокиДок.Доступность = Ложь;
		ЭтаФорма.Элементы.Декорация1.Заголовок = "Для изменения обратитесь к админитсратору"
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДопУпаковкаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ДопУпаковкаПриИзмененииНаСервере(Текст);
КонецПроцедуры

&НаСервере
Процедура ДопУпаковкаПриИзмененииНаСервере(Текст)
	
	ЗапросУп = Новый Запрос;
		ЗапросУп.Текст = "ВЫБРАТЬ
		                 |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		                 |ИЗ
		                 |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		                 |ГДЕ
		                 |	УпаковкиЕдиницыИзмерения.ПометкаУдаления = &ПометкаУдаления
		                 |	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		                 |	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование"; 
		ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		ЗапросУп.УстановитьПараметр("Владелец",Запись.ЭтапПроизводства.ВыходныеИзделия[0].Номенклатура);
		ЗапросУп.УстановитьПараметр("Наименование",Текст);
		РезультатЗапросаУп = ЗапросУп.Выполнить().Выгрузить();
		
		Если РезультатЗапросаУп.Количество() = 1 Тогда
			ЭтаФорма.Запись.ДопУпаковка = РезультатЗапросаУп[0].Ссылка;
		КонецЕсли;

КонецПроцедуры
